INSERT INTO users (full_name, username, password, role)
VALUES ('Пользователев Пользователь Пользователев', 'user1@test.ru', 'qwerty', 'Покупатель'),
       ('Пользователев Пользователь Пользователев', 'user2@test.ru', 'qwerty', 'Покупатель'),
       ('Пользователев Пользователь Пользователев', 'user3@test.ru', 'qwerty', 'Покупатель'),
       ('Пользователев Пользователь Пользователев', 'user4@test.ru', 'qwerty', 'Администратор'),
       ('Пользователев Пользователь Пользователев', 'user5@test.ru', 'qwerty', 'Администратор');

INSERT INTO carriers (name, phone_number)
VALUES ('Транспортная компания №1', '9991836999'),
       ('Транспортная компания №2', '8881632888'),
       ('Транспортная компания №3', '7771428777');

INSERT INTO routes (departure_point, destination_point, id_carrier)
VALUES ('Москва', 'Нижний Новгород', 1),
       ('Нижний Новгород', 'Казань', 2),
       ('Казань', 'Владивосток', 3);

INSERT INTO tickets (seat_number, time, price, routes_id)
VALUES (1, '2024-01-01 00:00:00', 20000, 1),
       (2, '2024-01-02 00:00:00', 18000, 2),
       (3, '2024-01-03 00:00:00', 26000, 3);